/*-------------------------------------------
功能：PORTA电平变化中断演示
版本：V1.0
日期：2021.01.05 

*本程序由 中微半导体 &应用支持部& 编写整理
*公司网址 www.mcu.com.cn

-------------------------------------------*/

#include <sc.h>


void main()
{
	asm("nop");
	asm("clrwdt");
	
	OSCCON = 0x70;			//内部振荡器用作系统时钟
	OPTION_REG = 0;			//预分频寄存器设置
	
	TRISB = 0;

//---------------------------------------	
	WPUA = 0B00000010;		//使能上拉，使RA1为高
	TRISA = 0B00000010;		//设置RA1的IO口为输入
	IOCA = 0B00000010;		//允许RA1的IO口电平变化中断
	RAIE = 1;				//使能PORTA电平变化中断
	INTCON = 0xC0;			//允许所有未被屏蔽的中断、允许外设中断，禁止INT外部中断
	RAIF = 0;				//清中断标志
	PORTA;					//读取PORTA并锁存
//---------------------------------------		

	while(1)			
	{
		asm("clrwdt");
	}
}


/***********************************************
函数名称：PA_Isr
函数功能：PA电平变化中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt PA_Isr()
{
	if(RAIF)
	{
		RAIF = 0;			//清中断标志
		RB3 = !RB3;
		PORTA;				//读取PORTA状态
		
	}
}