/*-------------------------------------------

程序名称：Timer0定时中断程序
日期版本：2023/06/14 <V1.0>

备注：   

*本程序由 &应用支持部& 编写整理
-------------------------------------------*/
#include <sc.h>					//芯片头文件，会根据工程选项自动寻找对应型号头文件

void main(void)
{
	asm("nop");
	asm("clrwdt");
	OSCCON = 0x72;				//16MHZ,内部振荡器用作系统时钟,CONFIG关闭WDT时必需软件打开WDT
	OPTION_REG = 0x00;			//配置TIMER0时间，00为2分频
	asm("clrwdt");
	/*********************************************************************
	预分频器控制寄存器 OPTION_REG（01H）
	Bit7  未用 
	Bit6  INTEDG:  触发中断的边沿选择位
		1=  INT 引脚上升沿触发中断
		0=  INT 引脚下降沿触发中断
	Bit5  T0CS:  TIMER0 时钟源选择位
		0=  内部指令周期时钟（FSYS /4）
		1=	T0CKI 引脚上的跳变沿
	Bit4  T0SE:	TIMER0 时钟源边沿选择位。
		0=	在 T0CKI 引脚信号从低电平跳变到高电平时递增
		1=	在 T0CKI 引脚信号从高电平跳变到低电平时递增
	Bit3  PSA: 预分频器分配位
		0=	预分频器分配给 TIMER0 模块
		1=	预分频器分配给 WDT
	Bit2~Bit0  PS2~PS0:  预分配参数配置位
		PS2  PS1  PS0  TMR0分频比  WDT 分频比 
		0    0    0  	1:2  		1:1 
		0  	 0	  1		1:4			1:2 
		0	 1	  0		1:8			1:4 
		0	 1	  1		1:16		1:8 
		1  	 0	  0		1:32		1:16 
		1	 0	  1		1:64		1:32 
		1	 1	  0		1:128		1:64 
		1	 1	  1		1:256		1:128 
	*********************************************************************/
	
	
	WPUA = 0B00000000;
	WPDA = 0B00000000;
	ODCONA = 0B00000000;			//配置PORTA输出情况
	IOCA = 0B00000000;
	TRISA = 0B00000000;
	
	WPUB = 0B00000000;
	WPDB = 0B00000000;
	ODCONB = 0B00000000;			//配置PORTB输出情况
	IOCB = 0B00000000;
	TRISB = 0B00000000;
	
	
	TMR0 = 6;					//设定Timer初始值，计时时间为（256-6）*4*2/16M=125uS
	T0IF = 0;
	T0IE = 1;					//使能Timer0溢出中断
	
	GIE = 1;					//开启总中断
	
	while(1)
	{
		asm("clrwdt");
	}
}
/***********************************************
函数名称：Timer0_Isr
函数功能：中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt Timer0_Isr(void)
{
	if(T0IF)
	{
		TMR0 += 6;			//TMR0不能自动赋值，操作TMR0的时候,TIME是不计数的
		T0IF = 0;
		
		PORTB ^= 0XFF;
	}
}


