/*-------------------------------------------

程序名称：Timer2定时程序，用外部32.768K晶振计时
日期版本：2023/07/14 <V1.0>

备注：   

*本程序由 &应用支持部& 编写整理
-------------------------------------------*/


#include <sc.h>				//芯片头文件，会根据工程选项自动寻找对应型号头文件

void Init_System();
void SystemSleep();

void main()
{
	Init_System();
	while(1)
	{
		asm("clrwdt");
		SystemSleep();		//进入低功耗模式
		
	}
}


/***********************************************
函数名称：Timer_Isr
函数功能：中断服务
入口参数：无
出口参数：无
备注：
************************************************/
void interrupt Timer_Isr()
{
	if(TMR2IF)				//若只使能了一个中断源,可以略去判断
	{
		//Timer2中断，每0.5s进一次
		TMR2IF = 0;

	}
	else
	{
		PIR1 = 0;
		INTCON &= 0XC0;
	}
}

/***********************************************
函数名称：Init_System
函数功能：系统初始化
入口参数：无
出口参数：无
备注：
************************************************/
void Init_System()
{
	
	asm("nop");
	asm("clrwdt");
	INTCON = 0;			//禁止中断
	OSCCON = 0X72;		//配置振荡为16M,开WDT
	OPTION_REG = 0;
	asm("clrwdt");
	
    WPUA  = 0B00000000;  //PA口上拉无效
	WPDA  = 0B00000000;  //PA口上拉无效
    WPUB  = 0B00000000;  //PB口上拉无效
    WPDB  = 0B00000000;  //PB口上拉无效
  
 
	TRISA = 0;
	TRISB = 0;
	 
	PORTA = 0B00000000;
	PORTB = 0B00000000;	 //关闭所有输出
	

	PIE1 = 2;			//使能Timer2中断,关闭其他中断

	PR2 = 0X80;
	T2CON = 0x8F;		//使能32.768KHz为Timer2计数时钟,Timer2后分频比为1:2，预分频1：16
						//128*4*16*2/(32.768*1000)=0.5S
	
	INTCON = 0XC0;		//使能中断	
	
	
	/**********  T2CON  *****************************************
		Bit7     CLK_SEL:  时钟源选择
			1=  选择外部 FLSE /4 作为 TMR2 时钟源（休眠态可继续计数）
			0=  选择内部 FSYS /4 作为 TMR2 时钟源
		Bit6~Bit3 TOUTPS<3:0>: TIMER2输出后分频比选择位。 
			0000= 1:1后分频比； 
			0001= 1:2后分频比； 
			0010= 1:3后分频比； 
			0011= 1:4后分频比； 
			0100= 1:5后分频比； 
			0101= 1:6后分频比； 
			0110= 1:7后分频比； 
			0111= 1:8后分频比； 
			1000= 1:9后分频比； 
			1001= 1:10后分频比； 
			1010= 1:11后分频比； 
			1011= 1:12后分频比； 
			1100= 1:13后分频比； 
			1101= 1:14后分频比； 
			1110= 1:15后分频比； 
			1111= 1:16后分频比。 
		Bit2 TMR2ON: TIMER2使能位； 
			1= 使能TIMER2； 
			0= 禁止TIMER2。
		Bit1~Bit0 T2CKPS<1:0>: TIMER2时钟预分频比选择位； 
			00= 预分频值为1； 
			01= 预分频值为4； 
			1x= 预分频值为16。  
	****************************************************************/
	
}


/***********************************************
函数名称：SystemSleep
函数功能：进入低功耗模式
入口参数：无
出口参数：无
备注：
************************************************/
void SystemSleep()
{
	
	PIE1 = 2;				//使能Timer2中断,关闭其他中断
	INTCON = 0XC0;
	if(0X8F != T2CON)
		T2CON = 0X8F;
	
	
	TRISA = 0;				//输出固定电平,减少功耗
	TRISB = 0;
	PORTA ^= 0XFF;	
							//关闭所有功能模块,减少功耗
	PWMCON0 = 0;
	OPTION_REG = 0;
	
	OSCCON = 0X70;			//配置振荡为16M,关闭WDT
	asm("clrwdt");
	
	SLEEP();				//进入休眠模式
	
	asm("nop");
	asm("clrwdt");
	OSCCON = 0X70;			//配置振荡为16M,关闭WDT
}
