
#include "CheckTouchKey.h"		//此包含放在最前面
		
//---------------------------------------------------
#include <sc.h>

volatile unsigned int MainTime;

/***********************************************************************
函数功能：延时子函数，13个指令周期1循环
***********************************************************************/
static void Delay(unsigned int dtemp) 
{
	while(dtemp--);
}
/***********************************************************************
子函数功能：延时templ  ms，有中断则不准
***********************************************************************/
static void Delay_nms (unsigned int inittempl)
{
	unsigned int	i;
	/******************************************************************/
	for(i=0;i<inittempl;i++)
	{
		Delay(154);
		CLRWDT();
	}
}

/**********************************************************
初始化程序
**********************************************************/
void System_Init()
{
	CLRWDT();					//清看门狗
	OSCCON = 0X71;				//配置振荡为8M
	OPTION_REG = 0B00001010;	//INT下降沿  预分频WDT 4*18=72ms  溢出(3V下约为144)
	WDTCON=1;
	
	TRISA = 0B11111111;			//触摸口
	TRISB = 0B11111111;			//触摸口
	TRISC = 0B11111111;					
	TRISE = 0B11111111;
	
	PORTA = 0;
	PORTB = 0;
	PORTC = 0;		
	PORTE = 0;					
	
	WPUA = 0;				//RA4为上拉输入	 按键检测口	
	WPUB = 0;
	WPUC = 0;
	WPUE = 0;
		 	
	PIE1 = 2;
	PIE2 = 0;
	INTCON = 0xC0;				//使能中断，允许int中断	
}

/**********************************************************
函数名称：Refurbish_Sfr
函数功能：刷新一些特殊功能寄存器
入口参数：无
出口参数：无 
备    注：每隔一定时间刷新一次SFR可增强抗干扰能力
**********************************************************/
void Refurbish_Sfr()
{
	CLRWDT();			//清看门狗
	OSCCON = 0X71;				//配置振荡为8M
	OPTION_REG = 0B00001010;	//INT下降沿  预分频WDT 4*18=72ms  溢出(3V下约为144)
	WDTCON=1;
	
	TRISA = 0B11111111;			
	TRISB = 0B11111111;				
	TRISC = 0B01111111;			
	TRISE = 0B01111111;
	
	WPUA = 0;						
	WPUB = 0;
	WPUC = 0;
	WPUE = 0;
		 	
	PIE1 = 2;
	PIE2 = 0;
	INTCON = 0xC0;				//使能中断，允许int中断
	
	T2CON =4;	
	PR2 =250;	
}

/***********************************************************
中断服务函数
***********************************************************/
void interrupt Isr_Timer()
{
	if(TMR2IE==1&&TMR2IF==1)				//若只使能了一个中断源,可以略去判断
	{
		TMR2IF = 0;
		MainTime++;
//------------测试程序--------------------------
											//CMS的芯片开了中断，可以做一些测试程序
	/*	if(MainTime < 5000)
		{
				TRISB = 0B01111111;					
				RB7 =~RB7;		
		}
		else
		{
			TRISB = 0B11111111;
			RB7 = 1;			

			if(MainTime >10000)
				MainTime =0;
		}*/
//------------------------------------------------------
	}

	else
	{
		PIR1 = 0;
		PIR2 = 0;
	}
}
/***********************************************************
主函数
***********************************************************/
void main()
{
	Delay_nms(100);			//延时等待电源电压稳定
	System_Init();			//系统初始化
		
	while(1)
	{
		
		Refurbish_Sfr();	//唤醒后刷新专用寄存器
		CheckTouchKey();	//触摸检测	
		
	}
}